<?xml version="1.0" ?>
<net name="bert-large-uncased-whole-word-masking-squad-0001" version="10">
	<layers>
		<layer id="0" name="bert.embeddings.word_embeddings.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="30522,1024" size="62509056"/>
			<output>
				<port id="0" names="bert.embeddings.word_embeddings.weight" precision="FP16">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="0" type="Parameter" version="opset1">
			<data element_type="i32" shape="1,384"/>
			<output>
				<port id="0" names="0" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="4145140/Cast_2105209_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="3" name="4145140" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="414" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="bert.embeddings.position_embeddings.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="62509064" shape="512,1024" size="1048576"/>
			<output>
				<port id="0" names="bert.embeddings.position_embeddings.weight" precision="FP16">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="409/Range_input_port_0/value/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="6" name="404" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="404" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="4055096/Cast_1106187_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557640" shape="" size="4"/>
			<output>
				<port id="0" names="403" precision="I32"/>
			</output>
		</layer>
		<layer id="8" name="4055096/Cast_2106189_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="9" name="4055096" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="405" precision="I64"/>
			</output>
		</layer>
		<layer id="10" name="410/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="410/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="410" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="407" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="407" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="4085018/Cast_1105077_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557644" shape="" size="4"/>
			<output>
				<port id="0" names="406" precision="I32"/>
			</output>
		</layer>
		<layer id="14" name="4085018/Cast_2105079_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="15" name="4085018" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="408" precision="I64"/>
			</output>
		</layer>
		<layer id="16" name="411/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="411/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="411" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="412" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="412" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="413/BroadcastingDim/Cast_1105771_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557648" shape="" size="4"/>
			<output>
				<port id="0" precision="I32"/>
			</output>
		</layer>
		<layer id="20" name="413/BroadcastingDim/Cast_2105773_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="21" name="413/BroadcastingDim" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64"/>
			</output>
		</layer>
		<layer id="22" name="409/Range_input_port_2/value/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="63557652" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="23" name="409/Range" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0"/>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="409/KeepShape/value/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="409" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="409" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="413" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="4154966/Cast_1" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" names="413" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="4154966/Cast_2105805_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="29" name="4154966" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="415" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="417" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="417" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="bert.embeddings.token_type_embeddings.weight/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="63557660" shape="2,1024" size="4096"/>
			<output>
				<port id="0" names="bert.embeddings.token_type_embeddings.weight" precision="FP16">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="2" type="Parameter" version="opset1">
			<data element_type="i32" shape="1,384"/>
			<output>
				<port id="0" names="2" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="4164926/Cast_2104929_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="34" name="4164926" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="416" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="418" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="418" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="4450_input_port_1/value/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="63561756" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="427" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" eps_mode="inside_sqrt" normalize_variance="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="427" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="bert.embeddings.LayerNorm.weight/EltwiseUnsqueeze46057_const" type="Const" version="opset1">
			<data element_type="f16" offset="63561764" shape="1,1,1024" size="2048"/>
			<output>
				<port id="0" names="bert.embeddings.LayerNorm.weight" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="428" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="428" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bert.embeddings.LayerNorm.bias/EltwiseUnsqueeze46061_const" type="Const" version="opset1">
			<data element_type="f16" offset="63563812" shape="1,1,1024" size="2048"/>
			<output>
				<port id="0" names="bert.embeddings.LayerNorm.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="429" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="429" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="431/1_port_transpose70141_const" type="Const" version="opset1">
			<data element_type="f16" offset="63565860" shape="1024,1024" size="2097152"/>
			<output>
				<port id="0" names="430" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="431" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="431" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="bert.encoder.layer.0.attention.self.query.bias/EltwiseUnsqueeze46065_const" type="Const" version="opset1">
			<data element_type="f16" offset="65663012" shape="1,1,1024" size="2048"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.self.query.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="432" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="432" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="440" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" names="440" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="4415164/Cast_1105785_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557640" shape="" size="4"/>
			<output>
				<port id="0" names="439" precision="I32"/>
			</output>
		</layer>
		<layer id="48" name="4415164/Cast_2105787_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="49" name="4415164" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="441" precision="I64"/>
			</output>
		</layer>
		<layer id="50" name="447/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="447/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="447" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="443" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" names="443" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="4445044/Cast_1105793_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557644" shape="" size="4"/>
			<output>
				<port id="0" names="442" precision="I32"/>
			</output>
		</layer>
		<layer id="54" name="4445044/Cast_2105795_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="55" name="4445044" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="444" precision="I64"/>
			</output>
		</layer>
		<layer id="56" name="448/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="448/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="448" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="449/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="65665060" shape="1" size="8"/>
			<output>
				<port id="0" names="449" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="450/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="65665068" shape="1" size="8"/>
			<output>
				<port id="0" names="450" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="451" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="451" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="452" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="452" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="453/Cast_1105475_const" type="Const" version="opset1">
			<data element_type="i64" offset="65665076" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="453" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="453" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="434/1_port_transpose70105_const" type="Const" version="opset1">
			<data element_type="f16" offset="65665108" shape="1024,1024" size="2097152"/>
			<output>
				<port id="0" names="433" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="434" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="434" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bert.encoder.layer.0.attention.self.key.bias/EltwiseUnsqueeze46069_const" type="Const" version="opset1">
			<data element_type="f16" offset="67762260" shape="1,1,1024" size="2048"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.self.key.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="435" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="435" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="455" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" names="455" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="4564988/Cast_1105101_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557640" shape="" size="4"/>
			<output>
				<port id="0" names="454" precision="I32"/>
			</output>
		</layer>
		<layer id="70" name="4564988/Cast_2105103_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="71" name="4564988" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="456" precision="I64"/>
			</output>
		</layer>
		<layer id="72" name="462/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="462/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="462" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="458" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" names="458" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="4595174/Cast_1105933_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557644" shape="" size="4"/>
			<output>
				<port id="0" names="457" precision="I32"/>
			</output>
		</layer>
		<layer id="76" name="4595174/Cast_2105935_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="77" name="4595174" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="459" precision="I64"/>
			</output>
		</layer>
		<layer id="78" name="463/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="463/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="463" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="464/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="65665060" shape="1" size="8"/>
			<output>
				<port id="0" names="464" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="465/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="65665068" shape="1" size="8"/>
			<output>
				<port id="0" names="465" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="466" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="466" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="467" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="467" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="483/Cast_1105197_const" type="Const" version="opset1">
			<data element_type="i64" offset="67764308" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="483" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="486_copy/const4855454312/EltwiseUnsqueeze54339_const" type="Const" version="opset1">
			<data element_type="f16" offset="67764340" shape="1,16,1,1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="486_copy" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="483" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="484" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="486" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="1" type="Parameter" version="opset1">
			<data element_type="i32" shape="1,384"/>
			<output>
				<port id="0" names="1" precision="I32">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="396/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="63557652" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="396/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="396" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="397/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="67764372" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="397/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="397" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="398" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_mul_4462846052/EltwiseUnsqueeze47125_const" type="Const" version="opset1">
			<data element_type="f16" offset="67764380" shape="1,1,1,1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="400/neg_/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="data_add_4463046053/EltwiseUnsqueeze47129_const" type="Const" version="opset1">
			<data element_type="f16" offset="67764382" shape="1,1,1,1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="400/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="402" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="487" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" names="487" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="488/FlattenONNX_/input_shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="488/FlattenONNX_/input_shape/Gather/Cast_1105897_const" type="Const" version="opset1">
			<data element_type="i32" offset="67764384" shape="3" size="12"/>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="488/FlattenONNX_/input_shape/Gather/Cast_2105899_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="103" name="488/FlattenONNX_/input_shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="488/FlattenONNX_/first_dims/Cast_1105365_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="488/FlattenONNX_/first_dims" type="ReduceProd" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="488/FlattenONNX_/second_dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="63561756" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="488/FlattenONNX_/first_dims/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="488/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>6144</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="488/Softmax_" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>6144</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>6144</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="488/ShapeOf_" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="488" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>6144</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="488" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="437/1_port_transpose70253_const" type="Const" version="opset1">
			<data element_type="f16" offset="67764396" shape="1024,1024" size="2097152"/>
			<output>
				<port id="0" names="436" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="437" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="437" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="bert.encoder.layer.0.attention.self.value.bias/EltwiseUnsqueeze46073_const" type="Const" version="opset1">
			<data element_type="f16" offset="69861548" shape="1,1,1024" size="2048"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.self.value.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="438" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="438" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="469" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" names="469" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="4705046/Cast_1105023_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557640" shape="" size="4"/>
			<output>
				<port id="0" names="468" precision="I32"/>
			</output>
		</layer>
		<layer id="118" name="4705046/Cast_2105025_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="119" name="4705046" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="470" precision="I64"/>
			</output>
		</layer>
		<layer id="120" name="476/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="476/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="476" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="472" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" names="472" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="4735010/Cast_1106139_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557644" shape="" size="4"/>
			<output>
				<port id="0" names="471" precision="I32"/>
			</output>
		</layer>
		<layer id="124" name="4735010/Cast_2106141_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="125" name="4735010" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="473" precision="I64"/>
			</output>
		</layer>
		<layer id="126" name="477/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="477/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="477" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="478/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="65665060" shape="1" size="8"/>
			<output>
				<port id="0" names="478" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="479/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="65665068" shape="1" size="8"/>
			<output>
				<port id="0" names="479" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="480" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="480" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="481" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="481" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="482/Cast_1105329_const" type="Const" version="opset1">
			<data element_type="i64" offset="65665076" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="482" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="482" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="489" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="489" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="490/Cast_1106149_const" type="Const" version="opset1">
			<data element_type="i64" offset="65665076" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="490" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="490" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="492" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="492" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="4934808/Cast_1105383_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557640" shape="" size="4"/>
			<output>
				<port id="0" names="491" precision="I32"/>
			</output>
		</layer>
		<layer id="139" name="4934808/Cast_2105385_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="140" name="4934808" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="493" precision="I64"/>
			</output>
		</layer>
		<layer id="141" name="498/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="498/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="498" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="495" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="495" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="4964814/Cast_1105673_const" type="Const" version="opset1">
			<data element_type="i32" offset="63557644" shape="" size="4"/>
			<output>
				<port id="0" names="494" precision="I32"/>
			</output>
		</layer>
		<layer id="145" name="4964814/Cast_2105675_const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="146" name="4964814" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="496" precision="I64"/>
			</output>
		</layer>
		<layer id="147" name="499/Dims/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="62509056" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="499/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="499" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="500/Unsqueeze/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="69863596" shape="1" size="8"/>
			<output>
				<port id="0" names="500" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="501" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" names="501" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="502" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="502" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="504/1_port_transpose70321_const" type="Const" version="opset1">
			<data element_type="f16" offset="69863604" shape="1024,1024" size="2097152"/>
			<output>
				<port id="0" names="503" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="504" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="504" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="bert.encoder.layer.0.attention.output.dense.bias/EltwiseUnsqueeze46077_const" type="Const" version="opset1">
			<data element_type="f16" offset="71960756" shape="1,1,1024" size="2048"/>
			<output>
				<port id="0" names="bert.encoder.layer.0.attention.output.dense.bias" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="505" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="505" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="156" name="506" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" names="506" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="157" name="4534_input_port_1/value/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="i64" offset="63561756" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
